module.exports = {
    fields: [
        {
            name: 'title',
            config: { boost: 10 }
        }, {
            name: 'body'
        }
    ],
    documents: [
        {
            "title": "لورم ایپسوم فارسی",
            "body": "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
            "id": 1
        }, {
            "title": "متن ادبی و آموزنده",
            "body": "مهم بودن را فراموش کنید تا آرامش نصیبتان شود. به یاد داشته باشید هر چه کمتر نیازمند تحسین دیگران باشید؛بیشتر تحسین میشوید. گاهی برتر بودن را به دیگران واگذار کنید و خوشبخت زندگی کنید. فراموش نکنید هر گز نمیتوانید عیب خود را با عیب جویی دیگران رفع کنید. یادتان باشد هر گاه در کار یا تصمیمی همه با شما هم عقیده اند یقین بدانید که اشتباه می کنید. اگر در مورد مردم قضاوت کنید دیگر وقتی برای رفع عیوب خود و دوست داشتن دیگران نخواهید داشت. انسان بسان رودخانه ایست؛هر چه عمیقتر باشد آرامتر است.تنها بک راه بسوی بهشت وجود دارد که در زمین آن را عشق مینامیم. او که برای ثروتمند شدن تعجیل میکند پاکدامن نخواهد ماند. تنفر از افراد؛مانند آن است که برای خلاص شدن از دست موش خانه اتان را آتش بزنید. آگاه باشید خنده و شادمانی بهترین نیایش جهان هستی است و نزدیکترین راه بسوی خداوند. انسان شاد دیگران را آزار نمیدهد بلکه آنها را نیز در شادی خود سهیم میکند. شاد باشيد و شاد زندگي كنيد",
            "id": 2
        }, {
            "title":"ایـــــــــــــــران",
            "body": "جمهوی اسلامی ایران در جنوب غرب آسیا واقع شده است.",
            "id": 3
        }
    ],
    tests: [
        {
            what: "find the word %w",
            search: "فارسی",
            found: 3
        }, {
            what: "find the word %w",
            search: "استعمال",
            found: 1
        }, {
            what: "never find a word that does not exist, like %w",
            search: "بطيخ",
            found: 0
        },{
            what: "find a correctly stemmed word %w",
            search: "كتب",
            found: 2
        }, {
            what: "find a word regardless of the differences in the number of expansions it has between it in the search and in the document, like %w",
            search: "ایــــــــران",
            found: 1
        }
    ]
}